v1/app/Controllers/Repositorios.php

SELECT *
FROM `oai_sets`
WHERE `identify_id` = '2'
ORDER BY `set_name`
SELECT COUNT(*) AS `numrows`
FROM `oai_records`
WHERE `repository` = '2'
---
    public function views($id)
    {

        $repositorioModel = new \App\Models\RepositorioModel();
        $data['r'] = $repositorioModel->find($id);
        $setModel = new \App\Models\OaiSetModel();



        // pega todos os sets do repositório
        $data['sets'] = $setModel->where('identify_id', $id)->orderby('set_name')->findAll();

        $OaiRecordModel = new \App\Models\OaiRecordModel();
        $data['stats']['total_records'] = $OaiRecordModel->where('repository', $id)->countAllResults();